; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	infrared1 - mode
	spectrograph0 - mode
	infrared2 - mode
	Star1 - direction
	Star2 - direction
	Star4 - direction
	Star0 - direction
	GroundStation3 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	Star5 - direction
	Star8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Star12 - direction
	Planet13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 infrared2)
	(calibration_target instrument0 Star0)
	(supports instrument1 infrared2)
	(supports instrument1 spectrograph0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation3)
	(calibration_target instrument1 Star5)
	(supports instrument2 infrared2)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 Star5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 Star5)
	(calibration_target instrument3 GroundStation6)
	(supports instrument4 infrared2)
	(calibration_target instrument4 Star5)
	(calibration_target instrument4 GroundStation7)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
)
(:goal (and
	(pointing satellite0 Phenomenon10)
	(have_image Star8 spectrograph0)
	(have_image Phenomenon9 infrared1)
	(have_image Phenomenon10 infrared1)
	(have_image Planet11 infrared2)
	(have_image Star12 spectrograph0)
	(have_image Planet13 infrared2)
	(have_image Star14 infrared1)
))

)

; plan
1. (turn_to satellite0 groundstation3 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 groundstation3)
   goals met: 0 of 8
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 8
3. (calibrate satellite0 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 0 of 8
4. (turn_to satellite0 planet13 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 planet13)
   goals met: 0 of 8
5. (take_image satellite0 planet13 instrument1 infrared2)
   added: (have_image planet13 infrared2)
   goals met: 1 of 8
6. (turn_to satellite0 planet11 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet11)
   goals met: 1 of 8
7. (take_image satellite0 planet11 instrument1 infrared2)
   added: (have_image planet11 infrared2)
   goals met: 2 of 8
8. (turn_to satellite0 phenomenon9 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon9)
   goals met: 2 of 8
9. (take_image satellite0 phenomenon9 instrument1 infrared1)
   added: (have_image phenomenon9 infrared1)
   goals met: 3 of 8
10. (turn_to satellite0 star12 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 star12)
   goals met: 3 of 8
11. (take_image satellite0 star12 instrument1 spectrograph0)
   added: (have_image star12 spectrograph0)
   goals met: 4 of 8
12. (turn_to satellite0 star14 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star14)
   goals met: 4 of 8
13. (take_image satellite0 star14 instrument1 infrared1)
   added: (have_image star14 infrared1)
   goals met: 5 of 8
14. (turn_to satellite0 star8 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star8)
   goals met: 5 of 8
15. (take_image satellite0 star8 instrument1 spectrograph0)
   added: (have_image star8 spectrograph0)
   goals met: 6 of 8
16. (turn_to satellite0 phenomenon10 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 phenomenon10)
   goals met: 7 of 8
17. (take_image satellite0 phenomenon10 instrument1 infrared1)
   added: (have_image phenomenon10 infrared1)
   goals met: 8 of 8
